{
  "default_language": "nl",
  "languages": ["en", "nl"],
  "translations": {
    "sidebar_welcome": {
      "en": "WELCOME",
      "nl": "WELKOM"
    },
    "sidebar_projects": {
      "en": "MY PROJECTS",
      "nl": "MIJN PROJECTEN"
    },
    "sidebar_skills": {
      "en": "SKILLS",
      "nl": "SKILLS"
    },
    "sidebar_contact": {
      "en": "CONTACT",
      "nl": "CONTACT"
    },
    "urg_description": {
      "en": "In this virtual reality game, your job is to knock down the drones to the beat of the music. Choose from a diverse selection of songs from easy to difficult and get the highest score.",
      "nl": "In deze virtueel reality game is het jouw taak om de drones neer te slaan op de beat van de muziek. Kies uit een gevarieerde selectie van liedjes van makkelijk tot moeilijk en krijg de hoogste score."
    },
    "info_title": {
      "en": "Brief info:",
      "nl": "Korte info:"
    },
    "ue5_info_create": {
      "en": "Created with: Unreal Engine 5",
      "nl": "Gemaakt met: Unreal Engine 5"
    },
    "asp_info_coding": {
      "en": "Created with: ASP.NET",
      "nl": "Gemaakt met: ASP.NET"
    },
    "blueprints_info_coding": {
      "en": "Coding language: Blueprints",
      "nl": "Codeertaal: Blueprints"
    },
    "urg_info_role": {
      "en": "My role: Creative Lead, Developer",
      "nl": "Mijn rol: Creative Lead, Developer"
    },
    "hlo_info_time": {
      "en": "Time spent: 10 weeks (3 days per week)",
      "nl": "Tijdspan: 10 weken (waarvan 3 dagen per week)"
    },
    "cont_title": {
      "en": "My contributions:",
      "nl": "Mijn bijdragen:"
    },
    "urg_cont_velocity_title": {
      "en": "Calculating Velocity:",
      "nl": "Velocity Berekening:"
    },
    "urg_cont_velocity_description": {
      "en": "The player must smash the blocks, but this may only happen if the player hits hard enough. Otherwise, he can also just keep his hands still and still get points. For this I worked (together with 2 other devs) on a calculation for how fast the hands move",
      "nl": "De speler moet de blokken kapot slaan, maar dit mag alleen gebeuren als de speler hard genoeg slaat. Anders kan hij ook gewoon zijn handen stil houden en nog steeds punten krijgen. Hiervoor heb ik gewerkt (Samen met 2 andere dev's) aan een berekening voor hoe snel de handen bewegen"
    },
    "urg_cont_spline_description": {
      "en": "The Drones follow a Spline Component to get to the player. This is a line that you can bend and stretch to whatever position you want. The drones then calculate how long the line is and then calculate how fast the drones have to move to (at whatever length) always follow the line at the same speed.",
      "nl": "De Drones volgen een Spline Component om naar de speler te gaan. Dit is een lijn die je kan buigen en strekken naar welke positie je maar wilt. De drones berekenen daarna hoelang de lijn is en berekenen daarna hoe snel de drones moeten bewegen om (met welke lengte dan ook) altijd even snel de lijn te volgen. "
    },
    "urg_cont_death_description": {
      "en": "Of course, the player must also be able to lose. If the player misses drones his hands get redder and redder and eventually the player loses. The drones fall and you are shown 2 blocks, try again or return to the start menu.",
      "nl": "De speler moet natuurlijk ook af kunnen gaan. Als de speler drones mist worden zijn handen steeds roder en uiteindelijk verliest de speler. De drones vallen en je krijgt 2 blokjes te zien, opnieuw proberen of terug naar het start menu. "
    },
    "app_description": {
      "en": "Bon Appmobile is a VR cooking simulator. The goal of the game is to bake pizzas and deliver them to homes. You drive around in a food truck in a big world where you can decide where to go. Will you bake the tastiest pizzas while driving?:",
      "nl": "Bon Appmobile is een VR kook simulator. Het doel van het spel is om pizza’s te bakken en te bezorgen bij de huizen. Je rijdt rond in een foodtruck in een grote wereld waarbij je zelf kan bepalen waar je heen gaat. Bak jij al rijdend de lekkerste pizza’s?:"
    },
    "app_info_role": {
      "en": "My role: Project Lead, Developer",
      "nl": "Mijn rol: Project Lead, Developer"
    },
    "app_cont_path_description": {
      "en": "The player should be able to drive around the map, we do this through a spline, or rather, multiple splines. Here I'll show you the code we used to get this result",
      "nl": "De speler moet kunnen rond rijden door de map, dit doen we door middel van een spline, of beter gezegd, meerdere splines. Hier laat ik de code zien die we gebruikt hebben om dit resultaat te krijgen"
    },
    "app_cont_blueprint_title": {
      "en": "The entire blueprint",
      "nl": "De gehele blueprint"
    },
    "app_cont_blueprint_description": {
      "en": "This is the whole blueprint, in which the car is placed on the spline we want to start with, then by measures of how far the car is on the spline we check if the car wants to take a turn. Then when the car comes to a fork, the car chooses to take the turn. This is the same for each spline. Each fork also has a 'straight through' side, this is purely the path the car will take if no side is chosen.",
      "nl": "Dit is de gehele blueprint, hierin wordt de auto geplaats op de spline waar we mee willen starten, dan naar maten van hoe ver de auto is op de spline checken we of de auto een bocht wilt nemen. Als de auto dan op een splitsing komt, kiest de auto ervoor om de bocht te nemen. Dit is voor elke splitsing hetzelfde. Elke splitsing heeft ook een 'rechtdoor' kant, dit is puur de weg die de auto zal nemen als er geen kant gekozen is."
    },
    "arcade_description": {
      "en": "For the Gamelab at the Grafisch Lyceum Utrecht, me and fellow student Justin van Diggelen built an arcade cabinet for students to create and play games for.",
      "nl": "Voor het Gamelab op het Grafisch Lyceum Utrecht hebben ik en mede student Justin van Diggelen een arcade kast gebouwd waar studenten spelen voor kunnen maken en spelen."
    },
    "arcade_info_role": {
      "en": "My role: Front-end",
      "nl": "Mijn rol: Front-end"
    },
    "arcade_frontend_title": {
      "en": "The UI",
      "nl": "De UI"
    },
    "arcade_frontend_description": {
      "en": "For the arcade cabinet, I put together the user interface for the menu to choose games from, this consists of a start screen, then to an area with rows of games (students can put these up themselves), and an info area that says what game it is, who made it and other useful info.",
      "nl": "Voor de arcade kast heb ik de user interface in elkaar gezet voor het menu om spellen uit te kiezen, dit bestaat uit een start scherm, dan naar een gebied met rijen aan spellen (deze kunnen studenten er zelf opzetten), en een info gebied waar staat welk spel het is, wie het hebben gemaakt en andere nuttige info."
    }
  }
}
